{"keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"padding": "valid", "kernel_regularizer": null, "batch_input_shape": [null, 256, 256, 3], "activity_regularizer": null, "filters": 32, "activation": "relu", "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "conv2d_1", "dilation_rate": [1, 1], "use_bias": true, "dtype": "float32", "bias_constraint": null, "strides": [3, 3], "trainable": true, "kernel_size": [7, 7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "padding": "valid", "trainable": true, "pool_size": [5, 5], "data_format": "channels_last", "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"padding": "valid", "kernel_regularizer": null, "activity_regularizer": null, "filters": 16, "activation": "relu", "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "dilation_rate": [1, 1], "use_bias": true, "trainable": true, "bias_constraint": null, "strides": [2, 2], "data_format": "channels_last", "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "padding": "valid", "trainable": true, "pool_size": [3, 3], "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"padding": "valid", "kernel_regularizer": null, "activity_regularizer": null, "filters": 8, "activation": "relu", "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_3", "dilation_rate": [1, 1], "use_bias": true, "trainable": true, "bias_constraint": null, "strides": [3, 3], "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "padding": "valid", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "strides": [1, 1]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "units": 100, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "units": 50, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "units": 15, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activity_regularizer": null, "activation": "softmax", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_4", "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}]}}