{"backend": "tensorflow", "keras_version": "2.2.4", "config": {"name": "sequential_2", "layers": [{"config": {"name": "conv2d_6", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "batch_input_shape": [null, 256, 256, 3], "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [3, 3], "data_format": "channels_last", "kernel_constraint": null, "padding": "valid", "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "bias_constraint": null, "dilation_rate": [1, 1], "filters": 32, "kernel_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_6", "padding": "valid", "trainable": true, "strides": [1, 1], "pool_size": [5, 5], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_7", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [5, 5], "kernel_regularizer": null, "data_format": "channels_last", "activation": "relu", "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 5], "bias_constraint": null, "dilation_rate": [1, 1], "filters": 16, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_7", "padding": "valid", "trainable": true, "strides": [1, 1], "pool_size": [3, 3], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_2", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"name": "dense_5", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 100, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_6", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 50, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_7", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 15, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_8", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 1, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}]}, "class_name": "Sequential"}